import os
from dotenv import load_dotenv

load_dotenv()

TELEGRAM_TOKEN = os.getenv('TELEGRAM_TOKEN')
OPENWEATHER_API_KEY = os.getenv('OPENWEATHER_API_KEY')

FOOD_DB = {
    "яблоко": 52, "банан": 89, "апельсин": 47, "груша": 57,
    "персик": 39, "виноград": 69, "клубника": 32, "арбуз": 30,
    "дыня": 34, "манго": 60, "ананас": 50, "киви": 61,
    
    "помидор": 18, "огурец": 15, "морковь": 41, "картофель": 77,
    "лук": 40, "чеснок": 149, "капуста": 25, "брокколи": 34,
    "цветная капуста": 25, "шпинат": 23, "салат": 15, "перец": 31,
    
    "курица": 165, "индейка": 135, "говядина": 250, "свинина": 242,
    "рыба": 206, "лосось": 208, "тунец": 184, "креветки": 85,
    "яйцо": 155, "яйцо куриное": 155,
    
    "молоко": 60, "кефир": 40, "йогурт": 60, "сметана": 200,
    "творог": 120, "сыр": 350, "сливочное масло": 717,
    
    "хлеб": 265, "батон": 260, "булка": 270, "круассан": 406,
    "рис": 360, "гречка": 343, "овсянка": 389, "макароны": 370,
    "картофель фри": 312, "пицца": 266, "бургер": 295,
    
    "шоколад": 546, "печенье": 450, "торт": 370, "мороженое": 207,
    "мед": 304, "сахар": 387, "варенье": 250,
    
    "орехи": 607, "арахис": 567, "миндаль": 575, "грецкий орех": 654,
    "семечки": 578, "фисташки": 560,
    
    "кофе": 1, "чай": 1, "сок": 45, "кола": 42,

    "пиво": 43, "вино": 83, "водка": 235}
